[{"content": "[u' If you were a fourteen year old child and were asked to choose a book from your grandpas library to read (and if none of the books were known to you, also you could not make out anything from the titles), which book out of the small, big, thick, thin, old, new, yellow-paged or white-paged books would you have chosen? Well, I took the smallest and thinnest book present in the shelf where my hand could reach. Without even bothering to spell the authors name correctly I opened the book and sat to read.   The book is called Zarathustras Discourses and is penned by Friedrich Nietzsche, considered as an important contributor to the 20th-century philosophy and theology. His views on the idea of Superman and that of God being dead might baffle you. You may or may not welcome the idea but reading him will surely make you breathe a different air. Thus spoke my grandpa to me!  This is the way I started writing and speaking things as each chapter of the book concludes with Thus spoke Zarathustra leading you to a new audacious discourse, a journey towardsseeking something between God and Human, towards seeking yourself. When I heard of Superman from my grandpa, I was fantasized and that was my second mistake of the day (first one being  judging the book from its dimensions). I was fourteen and so I could only imagine picture of the Superman that we saw in magazines and cartoon channels. Coming to the book review, Nietzsche was not an easy author to read. I, at times (most of the times) had to read the sentences twice or thrice to understand them and then the whole page again to connect the sentences. The thin book took the amount of time in which I couldve read 3-4 thick books. To read his book is like to get involved in a contest with yourself. The experience was not like reading a novel or a poem, it was like reading a genius.  Zarathustra, the protagonist, had left his home and went into the mountains. After some ten years, weary of his spirit and solitude, he set towards the town beside the mountain to teach people. At the very beginning of the book, he claims God to be dead which makes people detest him. It is laden with biblical allusions, but it also harshly condemns Christianity and mocks the idea of a holy scripture or a holy person. True freedom is only granted to those who can command themselves.  I teach you the Superman. Man is something that should be overcome. What have you done to overcome him?   And here starts the great journey of Zarathustra. I understood this sentence the second time I read the book at 17. Actually, most of the book. This time, as my grandpa said, I was left to think (after understanding! Formerly I was left to think what it meant). The idea of bermensch (overman) captures your attention and makes you stick to the book. First time when I read, half of the time went in reading it twice, understanding half of what I read and just quarter of it meant anything to me in real life. I had wrongly found this legendary writer a confusing personality. But my second reading made Nietzsches colors of philosophical art splash around me.   The overman is the full realization of a healthy will to power. He has gained complete power over himselfso that he is made up of his own will power. His character, his values, his spirit are all exactly as he has willed them to be. In that sense, the overman is totally free and absolutely powerful. In his first down-going, he talks of The three metamorphoses  a camel, alion and a child. The sublime idea behind it is that one should lay himself or herself with heavy loads and strive towards achieving mastery in your work. The next stage of a lion invigorates you to use your power and achieve the greatest heights with the help of mastery you acquired. And the last stage of a child tells you to use your freedom of expression and create something for yourself, for your own satisfaction. His idea of writing only with blood perplexed me at first, but his great theory behind it justifies it all. In morality, Nietzsche starts out by adopting the position of the relativist. He says there are no absolute values good and evil; these are mere means adopted by all in order to acquire power to maintain their place in the world, or to become the supreme.   At the end of the book, one feels like, Lo! I am weary of my wisdom, like the bee that hath gathered too much honey; I need hands outstretched to take it.  as Zarathustra felt like at the beginning of his journey. (Just a feel, not that I gained that much of wisdom or knowledge, though it did increase.)  The never-heard theories of the chairs of virtue, of afterworldsmen, despisers of the body, preachers of death, of the friend and many others are the ones which would never have come in front of a person before reading this book. Generally, in a book, it happens that you can summarize a page or a chapter or whole book but here I think it will take two-three sentences to explain one. One might expand the ideas on each and every preaching of his. Nietzsches deeply influential style of writing, heavy vocabulary and very heavy ideas are worth reading. It is worth giving a try to something other than our favorite fiction heroes, adventures, detectives and other such novels. I do not claim to have understood all his ideas (after reading it thrice) and still I get something new, something to think over every time I read it. Moving to the formal book review, it is a book worth reading for those who like to find something in the things around and inside one. The book was written in German and is translated by R.J.Hollingdale in English. It might decrease your reading rate but will surely give you something and a motivation to write in Self-Science Scion! ']", "title": ["Zarathustra’s Discourses"], "link": "http://entelechy.daiict.ac.in/public_html/entelechy_v2/?p=22898", "author": ["NEELANSHI"]},
{"content": "[u'Mythological fiction has turned out to be one of the emergent trends in the Indian, if not international, book circles. Taking a character from the pantheon of their ancestors, and rewriting their story to send out ones own message, to connect with the characters as normal mortals. Mythological fiction may have reached its culmination due to the fact that the characters are shown less like gods, and more like participants of a mortal life. Amidst the plethora of gods and themes selected to be portrayed, the epic Mahabharata has caught the eye of quite a few authors. The general momentum of all their works is in the direction of showing the epic in the light of a political drama from the point of view of various actors of the drama. The two versions of Mahabharata that I have read can be very easily classified as Pro-Kaurava and an impassive view of the war. On this point, I would suggest that one have a slight gist of the conventional Mahabharata. The first book, Ajaya, by Anand Neelakantan, focuses on developing the story from the vantage point of the Kauravas. ***The story works on a simple premise: if the Pandavas were the heroes of time when the strict and domineering laws of caste and jati, then the Kauravas have to be seen as the good guys in todays age.*** It primarily focuses on Suyodhana, who loves his family and is indifferent to the games of the throne. The story develops on the injustice to the lower caste and depravity of his brothers who blindly follow the laws put down by the power-mongering Brahmins. It gives a brief look on the political play between Kunti, Krishna and Gandhari. The second book loosely follows the events after the cheerharan. The author does not try to justify Suyodhanas heinous act but does explain the events before, of how the anger was embedded inside his psyche by the various co-actors of his life. In the background, we have the character of Shakuni as the plain old villain looking for retribution from Bhishma. The second book, Govinda, part of the Aryavarta chronicles and written by Krishna Udayashankara, looks at the story as a story trying to give an indifferent view of all the events happening in the country. The author has added an element of Firewrights and the Firstborns to provide motives to all the characters. The author has selected Krishna for the first person in most of the chapters. This story can be read by anyone and does not require previous knowledge of the Mahabharata or the Hindu pantheon. The author has changed the names of all the characters to the second names provided in the original Mahabharata. This gives a fresh view of the story and allows readers of the Mahabharata to easily shift and grab the view the author is trying to present. The writing style of Udayashankara is engaging and little easter eggs from the original act as a fresh mint break from the intricate politics of the land. One of the better things about this story was that the author deglorifies all the elements central to the story instead of starting from a glorified Kuru land. The Kuru land is shown as a vassal to the larger empire of Magadha ruled by the mighty Jarasandha famous for his death by the hands of Krishna. It is interesting to look at the events leading up to his assassination. The book focuses on the gray areas rather than depicting the characters as part of a black-and-white land. Each character is shown to have malice, valor, love, gratitude, fortitude and selfish ambitions. The point of this book review is to bring into attention the universe of characters present in our history. One cannot hear often enough, that India cannot create something as spectacular as the Marvel universe of superheroes. At this point, one can appreciate the web of stories that Hindu myths and scriptures and epics have created. If one could simply overlook the religious aspect of the story and see the gods as superheroes, one can appreciate the ingenuity of Indian rishis who were the original Stan Lees. One simply cannot miss references of Ramayana in Mahabharata and vice versa even though one is definitely older than other. This brings us to the second aspect of Indian myths. If one considers them from the standpoint of the creation of literature, all these myths are the largest open-source projects ever undertaken in the world. While this may be true of all the myths all around the world, what sets apart the Indian universe of superheroes is the fact that we have decided to bring about into real-life the events of our stories. Since most of the epics take place in real-life cities of India, people over the span of thousands of years have created memorials to their favorite superheroes. We have seen people worship various characters from various comic books for the ideology that the character stood for. How often have you indulged into a discussion of the Jokers psyche or Batmans motives or Ironmans technology? The only difference is that amidst the religious craze for our homemade superheroes, their ideologies are long lost, attaching basic emotions of good and bad on them. Books like Ajaya and Govinda bring out the dead ideologies of the characters. And one does not need to verify if that is what the storyteller intended originally, for a story is dependent on who is listening to it. While one can argue that the fanatic craze for the gods puts off the interest in them, one can simply read them and build their own ideologies around them. Do not forget, these stories that you hear have been modified and manipulated by billions of mortals that have passed these lands and if there is one thing that cannot be ignored is that it is a signature of our past and our ingenuity as well as our creativity. ']", "title": ["Mahabharata Retellings"], "link": "http://entelechy.daiict.ac.in/public_html/entelechy_v2/?p=22964", "author": ["Yashodhan Mohan Bhatnagar"]},
{"content": "[u'I ordered I Love Dick from amazon.in after reading a recommending review of it by a media personality I revere. I read ILD by Chris Kraus in the course of December 2015, a month well-spent in the comforting realms of sweet home. I have to confess it was the very first time I made sure a book wasnt loitering around in any random nook of my house (I possess a nomadic reading tendency) because I did not really want anyone from my family to read the title assuming Dick was used as a common noun and not proper. So I made sure it stayed hidden, becoming my little secret. This is how I Love Dick became my very first stealthily read book. The clandestine relationship we shared already registered ILD as one of my memorable reads, even before I began reading it. Our bond grew as I traversed its pages and fumed when its pages fumed, cried when its pages cried. When I finished reading the book, it seemed to me like I had discovered at last a narrative which is a fantastic riposte to all those stories where the Clever Woman is vulnerably victimized to the pressures of societal conventions. In ILD, the Clever Woman watches herself being made the victim and then grasps reigns to steer to where she is the sole protagonist in her story, no contribution of testosterone needed anymore; she untangles the skilled weave of tragedy she has allowed around herself with an absurd albeit effective tackle, and in doing so achieves in conveying what no woman considers is wise to articulate, apprehending the outsiders peek into the most frightening of her insides. Not only does ILD surpass conventional shackles of womens expressive writing, it doesnt consider conventions shackles in the first place. This is why I venture to say that ILD was this liberating literary mutiny I encountered, something Ive never been able to find so strong in any other book or story before. At first, I Love Dick promises to bear the appearance of a rather strange read. The book isnt autobiographical, although it is centered with Chris herself as the protagonist and all characters in the book do exist in real life, much so in the precise profile and outline the book portrays them to be in. The books first half is narrated in third-person and takes the form of a diary. The very first scene of the book is pivotal to comprehend its course; it begins with a scene of Kraus, her husband the philosopher Sylvere Lotringer, and his friend Dick Hebdidge, out to dinner at a sushi bar in Pasadena, and the narrative discloses everything important about the three main characters: their ages, their occupations, how they feel about each other and how well they know each other. Kraus is a genius; her style is effortlessbut deliberate, artful, flowing. Kraus doesnt participate much in the mens conversation, at the sushi bar and later, back at Dicks for the night: Because she does not express herself in theoretical language, no one expects too much from her. But she and Dick share what she thinks is a connection that transcends language: Some essential loneliness only she and he can share. On waking up in the morning, she decides that whats happened between them is a sort of mental one-night stand, a conceptual fuck. Chris thus begins her lopsided mental relationship with Dick. Between Chris and Sylvere exists an ostensibly complicated relationship, yet simple in its crux. They are long-married and no longer engage in sex, but remain fast friends, a friendship so crystal honest it can amount to threatening; they are both aware of their situation and are accepting of it. Chris hides nothing from him. When Sylvere learns about Chriss exponentially and embarrassingly escalating infatuation with Dick, they contemplate back and forth the idea of Krauss connection to Dick and eventually determine that they will start writing him confessional letters, as some sort of collaborative liberating art project. Thus begins a chain of letters with the Dear Dick salutation, becoming simply DD towards the end of the book, perhaps indicative of Chriss then state of mind, when Dick is no longer the object of her dependenceor the source of abjection, but a comforting phrase of emancipation. She has allowed herself to metaphorically perhaps kill Dick by simply reducing him to DD- Dear Diary. Chris Krauss strategy is both antagonistic and sublime. She stands on the cliff of her life, trying to steer ahead, crafting imaginary worlds and even infatuation to escape realism. Chris powerful account makes me wonder if all those bible stories I read over these years, that warn women not to turn around are just because she might see something. Like say, her life? But in a fantastic turn of events, instead of the book ending with Chriss decline, she actually manages to turn the tables- not on a particular guy called Dick, but on a conceited unreceptive observing culture. For these precise reasons, ILD is nothing less than a jeering mockery in a society of disparaging slaughterers, a deep laugh from behind a frightening mask. I understand now why the first ILD review I had read, remarked how with the advent of ILD, a new form of female life sprung up too. I promise ILD is nothing like anything youve read before, which is perhaps one of the reasons why it has elicited both fervent admirers and strong controversies. For me, ILD was this liberating cataclysm with clear, shameless ideologies, and the language sometimes instigating a good laugh which would linger throughout the day. ILD might strike as scandalous to some readers and critics, one of the important contributing reasons for this perhaps being the shameless intrusion by Chris Kraus on her own privacy. If you allow yourself to look beyond the books autobiographical milieu and level it with other fictional pieces- the approach it has been written as, you will find ILD is a beautifully written interrogator, a disturbing but an effective interrogator, and its interrogating clout is sure to linger in the minds of its readers.  ']", "title": ["Book Review: I Love Dick by Chris Kraus"], "link": "http://entelechy.daiict.ac.in/public_html/entelechy_v2/?p=22942", "author": ["SamriddhiSimlai"]},
{"content": "[u'This Novel is narrated by Death Six words. These were the words that got me into reading the book in the first place. The very fact of Death being a narrator caused a surge of adrenaline through my body.  Colors. That is how the narrator, Death, the darkest of the shades, begins. There can be no better beginning if not the colors because in The Book Thief words arent just a darker shade against the white, they reflect a total spectrum of colors of various emotions. As for Death, colors are, as he states, a distraction from the awful job and the length of time he has been doing it. In Zusaks world, Death is no Grim-reaper. Its his kinder and sympathetic version altogether. To put it in his words: I can be amiable, agreeable and affable. And thats the only As. But most of all, Death has a heart. The Book Thief is one of those stories in the large array of his pocket. Set in Nazi Germany at the start of World War 2, The Book Thief is about a girl and some words. Its a story that sheds light on the sufferings of the people (not just Jews) due to the Holocaust and the War. Death takes the reader into a brief flashback to the times when he met the book thief, describing the colors of the environment and those of his victims. And then he relives those years, the most crucial ones for both, Death and The Book Thief. Death had never been as busier as he was in those days.  Liesel Meminger ends up on Himmel (meaning heaven, which one finds ironic through the pages) Street in foster care owing to her poverty struck mother. She had been robbed of her brother (who dies while on their way to foster care). Later her mother disappears. A great deal had been taken away from her. So she steals books to settle the score. She stole the books but the words werent her. To quote Death: She was the book thief without the words. Her new Papa, Hans Hubermann is the one who gifts them. The words were on their way, and when they arrived, Liesel would hold them in her hands like the clouds, and she would wring them out like the rain. The Book Thief isnt one of those whose plot floats or lingers in ones head. It has got nothing to do with your white and grey. Its the heart that the beautiful words attack on. Markus Zusak has a way with words which shines through the pages. Various facts, definitions and drawings scattered throughout the book seem to lubricate the storytelling in an amazing way. For instance,  A Definition not found in Dictionary Not leaving  an act of trust and  love, often deciphered by children. Such centre-aligns are like the cherry on the cake.  Mama Rosa, who closely resembles those widely remembered typical foster mother from fiction, is the one balancing the sweetness of Papa. Her verbal exchange isnt complete without the words Saumench or Saukerl. She is downright abusive with the wooden spoons. And also one of the characters that evolves. You might think that the above text lacks something  Spoiler tags! But if you are to read the book (which I strongly recommend) then better get used to it, because thats how the whole narration is. Death teases with a lot of future. All that a reader would like to advise Markus is that Death isnt too cool to use spoiler tags. But what I believe is that the book isnt really a mystery to be solved but rather its a walk through Liesels life. Rudy Steiner, the boy next door and Max Vandenburg, the Jew in the basement are the ones to paint Liesels world. While Papa brought words to those colors and Rosa gave her the Hope. None of the characters seem flat as they all shine through the course. The Book Thief presents hope that is embodied in Liesel who grows up to be an amazing human amidst all inhumanity, poverty, suffering, and war. If Death has a heart then there surely is a Liesel residing somewhere.  Himmel Street is a place one would love revisiting. And with every visit, it would leave ones cheeks soaked in tears. It is definitely a story that would make one weep. Sadness would creep up with every passing page. But in the end, it all stands worthwhile. To quote Death,Its an attempt to prove to me that you and your Human existence are worth it. Markus Zusak has reflected the day to day heroism of the ordinary people. Its a world full of human kindness among the human cruelty that leaves even Death bewildered as he says,I am haunted by Humans. Moreover, its about the survival of Liesel with the dominoes falling around her. ']", "title": ["Book Review: The Book Thief"], "link": "http://entelechy.daiict.ac.in/public_html/entelechy_v2/?p=22877", "author": ["Vidhi"]},
{"content": "[u'This is a book by Paulo Coelho, the bestselling author. This happens to be my second Coelho book, after The Alchemist. But coming to this book, I feel it is about the feminine side of God. It gives an account of love and life. I like philosophical and historical books, which made me pick up this one up in the first place. One thing that I noticed in this book is that the phrase daughters and sons is used instead of sons and daughters, which is usually used in our society, which shows how the emphasis is put on the feminine side of thinking.  This book especially consists of great sentences about love and related truths. Phrases like To love is to lose, are used artistically by the author. Catholic terminologies and concepts are given which tempt you to read on. For a person like me who just started reading novels, the language is not that complex. The story flows with a few twists, so at some point one can find it boring, but hold on and it teaches much about living. It is written as a female character by the author. The story revolves around the female character who goes from her small place to the outer world and her love for the central character. Also, the concept of spiritual life and death is described. But it is all about her decision as well as his decision for their future. It gives an account of the dilemma between choosing love or religion in his life.  Some people will think that the story is not very interesting, but if one tries to understand the characters, the story is quite good. The female character, Pilar is a common girl with no great expectations in life. She is independent and strong. But when she goes to another part of the country to meet her childhood friend, he has transformed into a charismatic spiritual leader. There, she realizes what life can be if we try to overcome our difficulties. By his help, the feelings bottled up inside of her come out. Now they are together once again, embarking on a journey fraught with difficulties, as long-buried demons of blame and resentment resurface after more than a decade.  But in a small village in the French Pyrenees, she comes across some dazzling questions, the questions that each and every human has encountered. The questions that are unanswerable. The answers are more confusing than the questions themselves. Some of the events during this time change everything that Pilar believes in. Then comes the choice of a lifetime. Well, you should read the book to find out the answer. But one thing is certain that the choice for everyone is different in this matter. And she makes that choice with him.  At last, Pilar writes about her life and her love, sitting by the river Piedra  thus the title. And she finds the answer to the questions.She writes about it. I say just read the book and find out the answer. Maybe this is what is needed for your life and love.  Overall it is a great novel. Must read to maybe know yourself, as well as how to deal with tough situations in life.     ']", "title": ["Book Review: By the river Piedra I sat down and wept"], "link": "http://entelechy.daiict.ac.in/public_html/entelechy_v2/?p=22871", "author": ["Vyom"]},
{"content": "[u'Fear, to a great extent, is born of a story we tell  ourselves, and so I chose to tell myself a different story  from the one women are told. Wild is the lost and found story of Cheryl Strayed. She lost her mother in an untimely death due to cancer, she is unable to save her marriage, she loses her relations with her brother, she gets caught on the wrong side with drugs and men, she undergoes an abortion and thus her life is shaken to its very core. She changes her name to Strayed as she considered herself a real stray, lost on the roads of life. With all these going, she makes the most impulsive decision of her life: hiking the PCT  Pacific Crest Trail, with one companion  her backpack, which she called Monster. The trail is an eleven hundred miles track from California to Oregon to Washington State. The trail is an extensive track which encompasses desert to snow-clad mountains to lakes to grasslands. It is the story of her survival and experiences on the track, the people she met and how she reaches Bridge of the Gods, her final destination. With a huge pack she is hardly able to lift at the start and some books as her guide, she starts her journey. The simplicity and honesty of the author are the beautiful parts of the book. The moments of weakness she suffers are elaborately written, so relatable. The way she fights her every instinctof quitting her journey and her efforts to push her back on the trail, her every step on the track is worth reading and experiencing. Strayeds memoir is a story of her bravery, audacity, her struggle to be the women her mother thought her to be and an adventure that will change her life for the years to come. The things this book deals with from finding the inner self to an adventurous journey sure finds a little place in our shelves.  Wilderness had a clarity that included me.   ']", "title": ["Book review : Wild by Cheryl Strayed"], "link": "http://entelechy.daiict.ac.in/public_html/entelechy_v2/?p=22918", "author": ["aayushisutaria"]},
{"content": "[u'Edmond Dantes lives a happy life. He is young and in love with a girl who loves him back. He loves his work and has just been made the captain of his own ship. What could possibly go wrong? Set in the early 19th century, the book depicts a France divided into Bonapartists and Royalists. And this very division initiates the beginning of misfortune for Dantes. On his last voyage before getting married to his love Mercedes, Dantes was asked to deliver a letter given by Napoleon. Taking advantage of Frances instability, Dantes is framed for treason by two of his friends, Danglars and Mondego, one wanting his job and the other his woman, with the help of a magistrate Villefort. He is thrown into a prison for many years and is forgotten by the world. It is here in prison that he meets an elderly priest who completely changes Dantes. It is in this prison that Dantes is poisoned by the feeling of revenge. The priest, Faria, teaches him a lot of things and while dying reveals the location of the hidden treasure buried on the island of Monte Cristo. Dantes escapes, finds the treasure, takes on the identity of the mysterious Count of Monte Cristo and goes back to Marseille to take revenge. What is most noteworthy about the character Dantes is how he undergoes a gradual transformation in spirit and character. Before imprisonment, he is portrayed as the noble, nave gentleman minding his own business. In prison he enters into a very vulnerable and hopeless state during which point of time the idea of revenge keeps him going and helps him escape. As soon as he comes back, the first thing he does is help his old employer (who is essentially a good man) come out of bankruptcy. He also gives an old friend of his, who had wronged him earlier, another chance at a new life. After doing these acts of goodness, he sheds what little goodness remained in him, hardens his heart and sets out ruthlessly destroying those responsible for his horrible fate. What is perhaps most enjoyable in the novel is the intricacy and complexity of Dantes schemes. He takes his own sweet time slowly picking out what each of the three holds dearest and working relentlessly to destroy them; Villeforts reputation, Mondegos family life and Danglars career. Dantes, or as he now calls himself, the Count of Monte Cristo, manages to achieve all this by bringing in their children (who are all innocent) into the plot. Even though he has piles of wealth he learns he cannot control lives as much as he thinks he can. He finds himself turning into a father figure to these young people who he is trying to destroy. The relationship he has with Mercedes is perhaps the most interesting. Mercedes is told that Dantes has died in prison and is tricked into marrying Mondego. When Dantes returns, he is deeply troubled to know that she has given up on him so quickly. However, when she sees through his disguise as the Count and recognizes him for Dantes, he is genuinely torn between continuing his revenge or giving the idea up and living a happy life with Mercedes (who still loves him). Perhaps the most important question this book contains is whether revenge is evil or not. When we read the story from Dantes perspective we perceive him as an avenging angel. One keeps on wondering when Dantes will realize what his revenge is doing to those he truly loves (Mercedes and the children of his wrong-doers) and yet one has to sympathize with Dantes because being hard hearted is not easy. It only comes when you have passed, suffered and come out of the fire of agony. The book is a beautiful read. Dumas really delves into detail and creates a picture so intricate that you cannot help but imagine yourself a part of the story. The Count of Monte Cristo is the kind of novel you can sink into, it is an addiction; you know exactly where it is going but you still cant put it down. ']", "title": ["Book Review: The Count of Monte Cristo"], "link": "http://entelechy.daiict.ac.in/public_html/entelechy_v2/?p=22887", "author": ["Rahul Saranjame"]},
{"content": "[u'So many people walk around with a meaningless life. They seem half-asleep, even when theyre busy doing things they think are important. This is because theyre chasing the wrong things. The way you get meaning into your life is to devote yourself to loving others, devote yourself to your community around you, and devote yourself to creating something that gives you purpose and meaning. Mitch Albom used to think that he had it all: a good job, love, money and fame. He was a successful sports journalist, he had a daily radio show in Detroit, a loving wife and a large house. He was engrossed in his life, ignoring all the other little things that once mattered to him, pricking every bubble that ever dared to glide. He did not have the slightest hint of what he had been missing out on life until the day, when at 37, he switched on the television and saw his old college sociology professor, Morrie Schwartz, being interviewed about death. In his student days at University, he had considered Morrie a friend and a mentor. Morrie had encouraged him to read Erich Fromm and Martin Buber and to follow his inclination to be a musician. But since graduating, Albom had lost his touch with Morrie and the values he had taught him. In his own words ,I traded lots of dreams for a bigger paycheck, and I never even realized I was doing it. Seeing Morrie on television was to change all that. Having learned from television that Morrie was slowly dying of Lou Gehrigs disease-a debilitating disease that left his soul, perfectly awake, imprisoned inside a limp husk of a body , prompted him to travel from Michigan to Massachusetts to visit Morrie. Over a period of months, Morrie and Albom met regularly on most Tuesdays, Albom taped the meetings and Tuesdays with Morrie is the result. There are many themes in Tuesdays with Morrie, my favourite being the rejection of popular culture in favour of ones own values. Heres what I mean about building your own little subculture, Morrie said. I dont mean you disregard every rule of your community. I dont go around naked, for example. I dont run through red lights. The little things, I can obey. But the big things  how we think, what we value  those you must choose yourself. You cant let anyone  or any society  determine those for you. Tuesdays with Morrie is more than just a dying mans last words. It is an inspirational narration of a mans life  a man whose passion for the human spirit has continued to live long. When I first started reading Tuesdays with Morrie, I immediately thought of Maya Angelous Wont Take Nothing for my Journey Now. Angelou has a way of posing lifes biggest questions with such understanding you almost think she was sent by a higher power to help guide lost souls. While her poetic prose sweeps you away, Morries simple wisdom has the same affect. Morrie has led a simple yet meaningful life that inspires you to live yours to the fullest. Perhaps his story is more well built because youre not just taking in his wisdom, but you are experiencing his death. In his words, he is fortunate enough to know he is dying, to make full out of his life as it comes to an end. He handles this with courage and benevolence, and when the final moment comes you feel as though youve lost a dear friend. Alboms book is divided into chapters that give us Morries attitudes toward death, fear, aging, greed, marriage, family, society, forgiveness and a meaningful life. Morries advice to Albom boils down to recommendations that he should work less, give himself to others and remember he has to die. The book prepares you for the inevitable; no insane plots or dramatic twists. Its still very sad though, since it explores the fragility of life and I feel thats something everyone can relate to. I understand that people have certain literary preferences, so I would not recommend this to everyone. But I genuinely think that most people would benefit from reading this nonetheless. To me, it was a wonderful read. ']", "title": ["Book Review: Tuesdays with Morrie"], "link": "http://entelechy.daiict.ac.in/public_html/entelechy_v2/?p=22873", "author": ["Akriti Thakur"]},
{"content": "[u'What if time really is an illusion, and the universe we live in isnt the only one? How many versions of me then can possibly be out there?! What do they know, and what have they learnt? Every once in a while, a man comes forth who has the ability to challenge what everyone else accepts, or to imagine beyond a childs dreams. Richard Bach, in his One, moves past the illusions of time and space. Most of you know Richard Bach as the author of his evergreen Jonathan Livingston Seagull; some of you dont know him at all. I like to think of him as the man who showed the world the true meaning of flight.Although this is supposed to be a review of his celebrated book, One, I would hate to miss any opportunity to express my love for this mans incredible writing and exquisite imagination! Bach has the unique gift to look into alternate realities, measure each one and judge none. In his One, he along with his wife and soulmate, Leslie, gets a chance to travel across such realities. The story begins one afternoon as Bach and his wife are flying to Los Angeles in their seaplane when they are ripped off from this space time and thrown into an alternate universe. Whats so special about it? The world they are transported to contains within itself infinite dimensions, each one a lesson, each one a whole other universe in itself. What follows is a series of what-ifs and only-ifs as they face themselves in an age they had lived long ago, or in an age they never imagined they would face together. Guided by their spiritual guide, they see versions of themselves in others and find some part of their souls common to allsome part making them all one. Through this book, Bach professes the idea of oneness rather than diversity in people of all age, time and nationality. The reader as well finds himself one with the narrator as he speaks of small things and big; of crossroads and choices, of dreams and regrets. In our world humanity has strayed from that love. Continue and no one will see the sunrise. The sunrise will always exist, of course, but people on earth will know nothing of it and finally even stories of its beauty will fade from our knowing. Bach makes you fall in love with his simple approach to the complexities of the world, but then again not everything can be broken down and dealt with philosophy as he tries to. Perhaps thats the reason I come across reviews complaining that this book seemed too bizarre to continue with, for them. To them, I say thisbelieve. Believe in the absurdity he offers; it is worth the journey he takes you on. Whats so special about this man (and book)? Bach isnt philosophical, hes magical. Hes one of the rare ones who dont link spirituality with religion and consider oneself to be the seat of all the faith and love one needs. He has a certain charm and simplicity, that will always make you want more of him! Just as musicians feel about scores and melodies, dancers about steps and flow of music, so were one with the principle of flight, the magic of being aloft in the wind! If youre looking to delve into some fresh spiritism and have a new favourite, Richard Bach is the guy for you. Believe. And fly with him! ']", "title": ["Book Review: One"], "link": "http://entelechy.daiict.ac.in/public_html/entelechy_v2/?p=22867", "author": ["Nikita Verma"]},
{"content": "[u'Train to Pakistan is a highly acclaimed novel written by Khushwant Singh. I really didnt have a motive to read the book but seeing everyone around me with a copy drove me to explore it. I am glad that I did read the book because it made me feel the pain of the Partition. The novel is set in the summer of 1947. During this time, swarms of people were migrating across the border. As communal riots broke out, people were killed, their houses looted and their wives raped. This time being a tumultuous one arose the interest of the entire nation except small villages on the border. The story is set in one such village of Mano Majra. For the simple people of the village, partition meant nothing. The Muslims and Sikhs lived in harmony till the day when a ghost train of corpses arrives and changes the fate of the village. Khushwant Singhs style is simple and yet takes the readers back in time and helps them visualize the brutalities of the Partition. He tries to show the incidents through the eyes of different folks, the ignorant villagers, a political activist and the policemen. Khushwant Singh tries to bring about uniqueness in all his characters. Each character tells us something about the Indian Society and its behavior. The badmash of the village, Jugga is concerned for none, but the killings drove him to play on his life to save his Muslim love interest. Another important chap, Mr. Iqbal, a comrade, is a clean-shaven Sikh who believes in western ideologies and would always criticize the Indian way. For him, religion is of no importance and refrains to reveal his faith till the end. Hukum Chand, the magistrate, is symbolic of the government of that time. Compared to his colleagues, he is cleverer and with the help of the sub-inspector tries to avoid the misfortunes of partition in Mano Majra. The story is slow in the beginning but gains pace later. What I felt missing in the story was depth to Juggas character unlike Hukum Chand because in the end he is the one who emerges as the hero. The end surely is the best part of the book.Also, I would have liked Khushwant Singh to continue with the ending because somewhere in my heart I felt it incomplete. I wanted him to stress on the aftermath of the dark incident of the night. Apart from that, the book is a beautiful recollection of the past. The incidents narrated sent chills through my spine. We all have read books that talk about the atrocities of the World War but seldom we read about the past of our own country. So this is the book that one must go for! ']", "title": ["Book Review: Train to Pakistan"], "link": "http://entelechy.daiict.ac.in/public_html/entelechy_v2/?p=22865", "author": ["Saloni"]},
{"content": "[u'As a lover of Lewis Carrolls writings and of all things Alice in Wonderland, imagine my delight at discovering Alice in Quantumland: An Allegory of Quantum Physics! Gilmore writes in the preface: In the first half of the twentieth century, our understanding of the universe was turned upside down. The old classical theories of physics were replaced by a new way of looking at the world  quantum mechanics. This is in many ways at variance with the ideas of the older Newtonian mechanics; indeed, in many ways, it is at variance with our common sense. Nevertheless, the strangest thing about these theories is their extraordinary success in predicting the observed behavior of physical systems. However nonsensical quantum mechanics may at times appear to us, that seems to be the way that Nature wants it  and so we have to play along. While much of the narrative might appear nonsensical at first sight, and possibly it may seem so at the second, third, and twenty-fifth sight as well, Gilmore reminds us that for the most parts, these are true. He cites the godfather of quantum mechanics: Neils Bohr  is said to have remarked that anyone who did not feel dizzy when thinking about quantum theory had not understood it. Alices journey is off to a start as she falls into the swirling, sparkling TV screen  and ends up in Quantumland. Sometimes as an observer, while sometimes as a sort of particle, Alice travels in Quantumland which is rather like an amusement park. There, we follow her as she visits the Heisenberg Bank and the Mechanics Institute, learning about the curiouser and bizarre behaviors of particles. She is astonished by the Uncertain Accountant, whose attempts to balance books are muddled by energy fluctuations driven by the Heisenberg Uncertainty Principle. The State Agent shows her that, thanks to the Pauli Exclusion Principle, a particle can be two places at once. Later on, Alice visits the Experimental Physics Phun Phair, where the Great Paradoxus, calls for two subjects for an experiment he is demonstrating. Naturally, those are the twins, the Quantumland counterparts to Lewis Carrolls Tweedledum and Tweedledee: Eventually, two people were pushed forward. Both were dressed in long frock coats and narrow trousers, and both had bushy side whiskers. Both wore waistcoats, each with a gold chain attached to a watch which its owner had obviously checked recently against a reliable standard clock. These two were not actually identical to one another, since only particles are completely identical, but they were certainly very much alike. They were obviously both honorable, honest, and reliable as well as being competent and conscientious observers. If they were to say that they had seen something, no one would dream of disputing it. In fact, the most interesting chapter of the book deals with this notion of two versions of oneself, exploring virtual reality as Alice crashes into a backwards version of herself, an anti-Alice, while wandering in a pleasing flower garden with the Quantum Mechanic. To understand what made that encounter possible, Alice visits the State Agent, who presents her with an apparatus for seeing the virtual particles of antimatter. Meanwhile, Classical me: This is all nonsense! I believe in Einstein. Quantum me: But Einstein didnt see all the advances that Quantum mechanics has made. Classical me: Even if he did, its a bunch of theories, not persuasive enough. Quantum me: Be open minded, please. Classical me: You mean, mindless? Quantum me: If Im incorrect, why do the mathematical equations fit perfectly? Classical me: Mathematical tricks! Quantum me: Quantum mechanics seems to provide the most accurate explanations of the way things are in the physical world. Classical me: There must be some other thing Im missing. Im certain! Quantum me: Certainty? I follow probability. My mind:   The reader is finally relieved of all his troubles when suddenly Alice gets back to the real world! What a relief! This is a very interesting book, although the complex theories can cause a dizzy feeling. Different issues are highlighted in each chapter. Its accessible, yet in-depth, with scientific definitions. It had some great allegories for how some of the stuff in quantum worked, but other times you were still sitting there and scratching your head trying to figure out how thats supposed to work. Then you just kind of have to accept it [like, of faith], and faith and science are just kind of hard to mix in my mind. This book is much more for those who delight in puns about esoteric subjects. Every page has at least one silly math pun. I recommend it to imaginative science geeks. ']", "title": ["Book Review: Alice in Quantumland"], "link": "http://entelechy.daiict.ac.in/public_html/entelechy_v2/?p=22823", "author": ["Akriti Thakur"]},
{"content": "[u'Chowringhee is beautiful novel written by Bengali writer Sankar. Originally written in Bengali it was translated to English by Arunava Sinha who has done a wonderful job. Now Kolkata is a city that I absolutely adore and this novel explored Kolkata in its various shades. You get a glimpse of the lower class of the population as well as that of the elite most parts of the society and the wonderful thing about all this is the way the lives of people belonging to two extremes of the society connect. The protagonist of the novel Shankar and the author Sankar have a lot in common and for that reason the novel is semi-autobiographical in nature. This novel doesnt really have a plot as such but it is a collection of stories of different characters which are interlinked and interconnected with each other. And these characters happen to belong to totally different backgrounds, hence justifying the cosmopolitan nature of the city. It very well gives you a peek into the Calcutta of 50s, a post-Independence Indian city still very much British and still trying to find its own identity. One quality of this book that makes it different from many other books that I have read is the fact that you can read the novel at your own pace. You wouldnt want to complete the novel in one or two sittings, you wouldnt want the novel to end at all. The larger than life portrayal of Shahjahan hotel is another very different aspect of this novel. While characters come and go, live and die, Shahjahan remains constant and as majestic as ever. It wasnt so much a hotel as a framed picture. In the alluring curves was not the arrogance of modern skyscrapers but the stamp of ancient aristocracy. Like a beautiful brides bracelet, the neon light glinted in the darkness. It had three bands  green at the extremities and red in the middle; the flirtatious winking was limited to the green, while the red was like the unblinking eye   Shahjahan is the stage where all the plays are being enacted. Plays with actors completely different- different racially, financially, culturally and socially. And that is the whole gist of the novel, the fact that the scenes of a play change, the characters come and go but the stage remains constant and unchanged. It is a story of barmen, cabaret dancers, struggling private detectives, film-stars, industrialists, hostesses, struggling musicians, laundry men and anyone, who in any capacity, have been a part of the Shahjahan hotel on Chowringhee. The book also explores the darker sides of urban high class society. The hypocrisy surrounding the lives of the people who appear to have a very glamorous and happy life otherwise. The complex nature of the characters teaches us that we cant really know whats going on in the life of a person by their appearances only. The two characters whose stories I found were most touching and special were Karabi Guha and Connie. Karabi Guha, a hostess in a suite at Shahjahan is a victim of circumstances when she falls in love with the son of a very influential industrialist. Connie on the other hand works as a bar dancer to make ends meet for herself. Infact all the female characters in the book have subtly tragic to very tragic stories perhaps because the female characters are slightly stereotyped; all of them being single, poor and lonely. Although the female characters have certain similar traits but their stories and characters are very different. Eventually Marco Polo, Sata Bose and many other characters go their separate ways thus leaving Shankar alone at Shahjahan. The way he talks about old times makes you feel heartbroken and nostalgic. It seems as if you connect to these characters at a deeper level and you yourself have become a part of the Shahjahan family. When I had checked in here, it was filled with known and familiar faces. Some left after breakfast; a few disappeared after lunch; others went away after tea. Now it was time for dinner, and no one was left  I, the patriarch, seemed to have sat down at an empty table. The book is full of life, emotions and colour. It is a story of the city which is very vibrant and exotic. Shahjahan is Calcutta and all the characters represent one or the others parts of the population of city. It is a perfect book if you want to explore about human nature or be a part of a roller-coaster that through its ups and downs will leave you amazed. ']", "title": ["Book Review: Chowringhee"], "link": "http://entelechy.daiict.ac.in/public_html/entelechy_v2/?p=22846", "author": ["KritiU"]}]